# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet..::..Contains Method
ProjectLocationSet Class See Also
---
Tests for the existence of a project location within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	ProjectLocation item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As ProjectLocation _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	ProjectLocation^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ProjectLocationThe project location to be searched for.
# ### Return Value
The Contains method returns True if the project location is within the set, otherwise False.
# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace